Лицензия MIT

Copyright (c) 2026 JavaBruse

Настоящим предоставляется бесплатное разрешение любому лицу, получившему копию данного программного
обеспечения и сопутствующей документации (далее — "Программное обеспечение"), на использование
Программного обеспечения без ограничений, включая права на использование, копирование, изменение,
объединение, публикацию, распространение, сублицензирование и/или продажу копий Программного
обеспечения, а также на предоставление Программного обеспечения другим лицам при соблюдении
следующих условий:

Указанное выше уведомление об авторских правах и данное разрешение должны быть включены во все
копии или существенные части Программного обеспечения.

ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ "КАК ЕСТЬ", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ, ЯВНЫХ ИЛИ
ПОДРАЗУМЕВАЕМЫХ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ГАРАНТИЯМИ ТОВАРНОЙ ПРИГОДНОСТИ,
СООТВЕТСТВИЯ КОНКРЕТНОМУ НАЗНАЧЕНИЮ И НЕНАРУШЕНИЯ ПРАВ. НИ В КАКОМ СЛУЧАЕ АВТОРЫ ИЛИ
ПРАВООБЛАДАТЕЛИ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ ЗА ЛЮБЫЕ ТРЕБОВАНИЯ, УБЫТКИ ИЛИ ИНЫЕ ОБЯЗАТЕЛЬСТВА,
БУДЬ ТО В РЕЗУЛЬТАТЕ ИСКА, ПРИЧИНЕНИЯ ВРЕДА ИЛИ ИНЫХ ДЕЙСТВИЙ, ВОЗНИКШИЕ ИЗ ПРОГРАММНОГО
ОБЕСПЕЧЕНИЯ ИЛИ ЕГО ИСПОЛЬЗОВАНИЯ.